read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FrontBus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a29d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_TileResetSetter.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_57.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundRawFNToRecFN_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a13d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Atomics.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DigitalTop.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDeserializer_TLBeatw67_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockCrossingReg_w32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a21d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a29d64s7k1z3u_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SerialTL0ClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rockettile_icache_data_arrays_0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SinkC.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x120.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x118.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_44.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CaptureChain_JTAGIdcodeBundle.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_BundleMap.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntToFP.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a29d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/JtagBypassChain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRecFM_small_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Arbiter3_LLWB.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RecFNToRecFN.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IBuf.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_l2_ctrl.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_RegMapperInput_i23_m8.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a32d64s2k3z4c_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/cc_banks_0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_13.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/JtagStateMachine.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundAnyRawFNToRecFN_ie11_is53_oe8_os24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockGroupAggregator_allClocks.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPToInt.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PMPChecker_s3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_fbus_i2_o1_a32d64s5k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundAnyRawFNToRecFN_ie11_is55_oe11_os53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/InclusiveCache.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_SourceXRequest.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MSHR.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ListBuffer_PutBufferAEntry_q40_e40.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_cbus_in_i2_o1_a29d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLAtomicAutomata_pbus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TileResetSetter.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockGroupCombiner.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_mbus_i1_o2_a32d64s4k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a28d64s4k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_23.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CLINT.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLCFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_25.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_dmixbar_i1_o2_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/head_21x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PlusArgTimeout.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a29d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_12x109.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_DirectoryWrite.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SinkD.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncCrossingSource_n1x1_Registered.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLAtomicAutomata_cbus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SinkA.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_46.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNToRaw_preMul_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SynchronizerShiftReg_w1_d3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a21d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundAnyRawFNToRecFN_ie8_is26_oe8_os24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Arbiter2_Valid_PTWReq.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPU.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRawFN_small_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_31.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/JtagTapController.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLUARTClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNToRaw_postMul_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a29d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a26d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RocketTile.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceD.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a28d64s4k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RVCExpander.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleC_a32d64s6k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_data_3x64.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDebugModuleInner.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_sbus_i2_o2_a32d64s6k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s3k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/cc_banks_2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/tail_21x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a32d8s1k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_59.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ChipyardPRCICtrlClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLUART.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TileClockGater.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleA_a32d64s6k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ChipTop.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLError_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a28d64s4k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDToBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_SinkXRequest.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x10.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PMAChecker.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RecFNToIN_e11_s53_i32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/next_16x4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_flit_8x32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncAsyncCrossingSink_n1x1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a32d64s5k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FixedClockBroadcast_4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceX.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s4k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSource_TLBundleD_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_28.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetRegVec_w1_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_40.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_8.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericSerializer_TLBeatw87_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_sink_2x3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CoherenceManagerWrapper.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IDPool.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a14d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLAFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDigitalInIOCell.v
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x104.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ShiftQueue.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSink_DebugInternalBundle.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRecFMToRaw_small_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/data_40x73.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PMPChecker_s2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/cc_banks_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetRegVec_w1_i1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a32d64s4k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a17d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BreakpointUnit.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_20.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SinkX.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockCrossingReg_w15.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_16.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_12.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_37.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ITLB.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBToBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDeserializer_TLBeatw88_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a14d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleC_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRawFN_small_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNToRaw_postMul_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_50.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockGroupResetSynchronizer.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue8_UInt8.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_11.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_mbus_to_memory_controller_port_named_axi4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_18.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SystemBus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MemoryBus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s5k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a14d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rockettile_dcache_tag_array.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_35.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a28d64s4k1z3u_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AMOALU.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPToFP.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PLICClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueue.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a32d64s6k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ResetCatchAndSync_d3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x82.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/mem.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a29d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_AXI4BundleW.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockCrossingReg_w43.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/cc_dir.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a28d64s4k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PhitToFlit_p32_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Frontend.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AXI4IdIndexer.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_8x8.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BankedStore.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleE_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w1_d3_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPUFMAPipe_l4_f64.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_34.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceB.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ScratchpadBank.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ClockCrossingReg_w55.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/HellaCacheArbiter.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/OptimizationBarrier_TLBEntryData.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_30.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_49.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleD_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceA.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_33.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w4_d3_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_39.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AXI4UserYanker.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/InclusiveCacheBankScheduler.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_51.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_9.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_Debug.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericSerializer_TLBeatw67_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_27.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLEFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLCacheCork.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/head_2x4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_fbus_from_port_named_serial_tl_0_in.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLRAM_ScratchpadBank.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/INToRecFN_i64_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x52.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_RegMapperInput_i9_m8.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_BankedStoreInnerAddress.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/cc_banks_3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSource_TLBundleA_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Rocket.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDebugModuleInnerAsync.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDebugModuleOuterAsync.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_48.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SinkE.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DecoupledSerialPhy.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_43.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDeserializer_TLBeatw10_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/tail_40x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulDiv.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/UARTRx.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPUDecoder.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rockettile_dcache_data_arrays_0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLSerdesser_serial_tl_0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/EICG_wrapper.v
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/InclusiveCacheControl.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BTB.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x79.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_AXI4BundleARW.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_21.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue8_Flit.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDFromBeat_serial_tl_0_a64d64s8k8z8c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLPLIC.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FixedClockBroadcast_7.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetSynchronizerPrimitiveShiftReg_d3_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_54.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceE.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ProbePicker.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_17.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a12d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSink_TLBundleD_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_26.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x110.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_prcibus_i1_o2_a21d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_47.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_ScratchpadBank.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SBToTL.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ListBuffer_PutBufferCEntry_q2_e16.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/UARTTx.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x109.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/NonSyncResetSynchronizerPrimitiveShiftReg_d3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleD_a26d64s11k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_19.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x83.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CaptureUpdateChain_DTMInfo_To_DTMInfo.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PhitDemux_p32_f32_n5.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FlitToPhit_f32_p32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLROM.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_cbus_out_i1_o8_a29d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BankBinder.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DCacheDataArray.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue3_BankedStoreInnerDecoded.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BootROMClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PhitArbiter_p32_f32_n5.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/tail_2x4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PTW.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue12_TLBundleC_a32d64s3k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_5.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_58.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TilePRCIDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_22.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLToAXI4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PeripheryBus_cbus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNPipe_l2_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FixedClockBroadcast_3.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/SourceC.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rockettile_icache_data_arrays_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleA_a26d64s11k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_41.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_MasterXbar_RocketTile_i2_o1_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CompareRecFN.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ICache.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleD_a32d64s6k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ErrorDeviceWrapper.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a29d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ALU.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSource_DebugInternalBundle.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNToRaw_preMul_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_PLIC.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRecFM_small_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_LLCCtrl.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntXbar_i1_o1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncCrossingSource_n1x1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLXbar_pbus_out_i1_o2_a29d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncValidSync.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBusBypassBar.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_55.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DMIToTL.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_UART.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CSRFile.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_bootrom.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x114.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/plusarg_reader.v
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CaptureUpdateChain_UInt5_To_UInt5.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RecFNToIN_e11_s53_i64.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FixedClockBroadcast_2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ResetSynchronizerShiftReg_w1_d3_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundRawFNToRecFN_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a21d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_fbus_from_debug_sb.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DivSqrtRecFMToRaw_small_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/INToRecFN_i64_e11_s53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncSyncCrossingSink_n1x2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/table_512x1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLWidthWidget1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSource_Phit.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSink_TLBundleA_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDigitalOutIOCell.v
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/GenericDeserializer_TLBeatw87_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetSynchronizerShiftReg_w1_d3_i0_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue1_TLBundleA_a14d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBuffer_a26d64s11k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x112.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rf_31x64.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDebugModule.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncCrossingSource_n1x2.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a29d64s7k1z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncQueueSink_Phit.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CLINTClockSinkDomain.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_56.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/regfile_32x65.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s4k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_pbus_to_bootaddressreg.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_pbus_to_device_named_uart_0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/CaptureUpdateChain_DMIAccessCapture_To_DMIAccessUpdate.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundAnyRawFNToRecFN_ie7_is64_oe11_os53.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Directory.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_15.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_14.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_CLINT.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/OptimizationBarrier_PTE.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_BootAddrReg.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/LevelGateway.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_52.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_42.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DebugTransportModuleJTAG.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/data_33x44.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleE_a32d64s3k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleA_a28d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/rockettile_icache_tag_array.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_debug.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/DCache.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_45.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PLICFanIn.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_29.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x117.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntSyncSyncCrossingSink_n1x1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_7.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLAsyncCrossingSink_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_BootROM.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLAsyncCrossingSource_a9d32s1k1z2u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/next_33x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/BundleBridgeNexus_UInt1_1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLFragmenter_TileClockGater.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a32d64s5k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x119.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MulAddRecFNPipe_l2_e8_s24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLDebugModuleOuter.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleA_a21d64s7k1z3u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLBusBypass.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_4.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/MaxPeriodFibonacciLFSR.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/next_40x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_plic.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ram_2x80.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleB_a32d64s2k3z4c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_38.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/FPUFMAPipe_l3_f32.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/OptimizationBarrier_UInt.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/data_16x65.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLError.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_clint.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLInterconnectCoupler_cbus_to_prci_ctrl.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/IntXbar_i4_o1.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/RoundAnyRawFNToRecFN_ie7_is64_oe8_os24.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/AsyncResetRegVec_w2_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Repeater_TLBundleD_a32d64s1k3z4u.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/head_40x6.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/ListBuffer_QueuedRequest_q21_e33.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/PeripheryBus_pbus.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/Queue2_TLBundleD_a32d64s3k3z3c.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_10.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/TLMonitor_36.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/InferredResetSynchronizerPrimitiveShiftReg_d3_i0.sv
read_verilog /scratch/joonho.whangbo/coding/chipyard-emul/sims/verilator/generated-src/chipyard.harness.TestHarness.SingleClockRocketConfig/gen-collateral/chipyard.harness.TestHarness.SingleClockRocketConfig.top.mems.v
hierarchy -check -top DigitalTop
blackbox cc_dir_ext
blackbox cc_banks_0_ext
blackbox rockettile_dcache_data_arrays_0_ext
blackbox rockettile_dcache_tag_array_ext
blackbox rockettile_icache_tag_array_ext
blackbox rockettile_icache_data_arrays_0_ext
blackbox mem_ext
proc;    opt -nodffe -nosdff
memory;  opt -nodffe -nosdff
techmap; opt -nodffe -nosdff
async2sync;
dffunmap;
flatten
abc -lut 3
opt -nodffe -nosdff;
write_blif DigitalTop.lut.blif
